{
    "black company": {
		"brother": {
		    "description": "Your character is a Brother of the Black Company, the last of the famous Free Companies of Khatovar. You use the Fighter class table save where noted below.",
		    "features": {
		        "hit_point_die": {
		            "name": "Hit Point Die",
		            "description": "d10 per Fighter level"
		        },
		        "saving_throws": {
		            "name": "Saving Throws",
		            "description": "Choose one of Str, Int, or Cha and one of Con, Dex, or Wis. You gain proficiency in your chosen saving throws."
		        },
		        "skills": {
		            "name": "Skills",
		            "description": "Choose five skill proficiencies and one tool proficiency."
		        },
		        "weapon_proficiencies": {
		            "name": "Weapon Proficiencies",
		            "description": "Simple and Martial weapons."
		        },
		        "armor_training": {
		            "name": "Armor Training",
		            "description": "Light and Medium armors and Shields. Heavy armor proficiency if Sawbones, Bump, Deacon, or Salt."
		        },
		        "ability_score_modifiers": {
		            "name": "Ability Score Modifiers",
		            "description": "+2 to one ability score and +1 to another, OR +1 to three ability scores. None can raise a score above 16 at level 1."
		        },
		        "languages": {
		            "name": "Languages",
		            "description": "Common, Khato. Bonus language per Intelligence modifier point."
		        },
		        "starting_money": {
		            "name": "Starting Money",
		            "description": "200gp. You may purchase gear from the PHB at listed prices."
		        },
		        "subclass": {
		            "name": "Subclass",
		            "description": "Choose one Fighter subclass at 1st level from the available list."
		        }
		    }
		},
		"traits": {
		    "Fast": {
		        "name": "Fast",
		        "description": "Your base speed is increased by 15 ft."
		    },
		    "Fey-Touched": {
		        "name": "Fey-Touched",
		        "description": "Choose an ability such as Int, Wis, or Con. You are proficient with saving throws for that ability."
		    },
		    "Jumpy": {
		        "name": "Jumpy",
		        "description": "You roll initiative as normal, but your result can never be lower than 10 unless you choose to accept a lower result. In addition, add your proficiency bonus to weapon damage you deal during the first round of an encounter."
		    },
		    "Lingerer": {
		        "name": "Lingerer",
		        "description": "Increase your maximum hit points by +2 at 1st level, and +1 hp each level thereafter."
		    },
		    "Lucky": {
		        "name": "Lucky",
		        "description": "Once per day you may reroll a natural 1 on a D20 Test."
		    },
		    "Odd Fellow": {
		        "name": "Odd Fellow",
		        "description": "Choose two of the following damage types: acid, cold, fire, lightning, thunder, or necrotic. You gain resistance against those two damage types. This also applies to environmental effects such as excessively hot or cold weather."
		    },
		    "Relentless": {
		        "name": "Relentless",
		        "description": "When you are dropped to 0 hit points, you instead are dropped to 1 hit point. This trait recharges with a Long Rest."
		    },
		    "Savage": {
		        "name": "Savage",
		        "description": "You roll two extra weapon dice on critical hits."
		    },
		    "Skill Monkey": {
		        "name": "Skill Monkey",
		        "description": "You gain proficiency in two skills, and you gain two languages or tool proficiencies."
		    }
		},
		"quirks": {
		    "Bird Bones": {
		        "name": "Bird Bones",
		        "description": "You suffer a -1 penalty to AC while wearing Medium or Heavy armor."
		    },
		    "Borrowed Time": {
		        "name": "Borrowed Time",
		        "description": "You suffer a -2 penalty on death checks."
		    },
		    "Brittle": {
		        "name": "Brittle",
		        "description": "Reduce your hit point die to d8."
		    },
		    "Not a Killer": {
		        "name": "Not a Killer",
		        "description": "When you score a critical hit, make a Luck check. On a failure, the hit becomes a normal hit."
		    },
		    "Shiftless": {
		        "name": "Shiftless",
		        "description": "You roll initiative as normal, but your result can never be higher than 10. In addition, any damage you deal on the first round of an encounter is halved."
		    },
		    "Slow": {
		        "name": "Slow",
		        "description": "Your base speed is reduced by -15 ft. with a minimum of 10 ft."
		    },
		    "Sponge": {
		        "name": "Sponge",
		        "description": "Choose two of the following damage types: acid, cold, fire, lightning, thunder, or necrotic. You take +1 damage per die from those damage types."
		    },
		    "Star-Crossed": {
		        "name": "Star-Crossed",
		        "description": "You suffer a -1 penalty to saving throws."
		    },
		    "Unfortunate": {
		        "name": "Unfortunate",
		        "description": "When making an individual (not a group) Luck check, you suffer a -2 penalty to Luck check rolls."
		    }
		}
    },
	"black banner": {
    "description": "The Banner is more than cloth and pole. It is the Company's soul given color and shape. When raised, it steadies men's hearts and binds them to purpose. When it falls, the line falters.",
	"use": "When a brother plants the banner, its magic flares to life, filling the air with a faint shimmer visible only to other brothers. Its magic cannot be dispelled.", 
    "features": {
        "action": {
            "name": "Action",
            "description": "Planting or hoisting the Banner is a free action that must be done on your turn. The Banner must be set firmly into the ground or another stable surface."
        },
        "aura_radius": {
            "name": "Aura Radius",
            "description": "While upright, the Banner emits a 10-foot aura. At 10th level, this radius increases to 20 feet."
        },
        "aura_effect": {
            "name": "Aura Effect",
            "description": "The aura effect depends on the type of aura chosen when first planted. Only one aura may be active per encounter. The aura persists until the banner is moved, destroyed, or the encounter ends."
        },
        "durability": {
            "name": "Durability",
            "description": "The banner has 30 hit points +4hp per banner level. The banner's AC is equal to 15 plus the party's proficiency bonus. It is immune to psychic and poison damage and has resistance to piercing damage."
        },
        "restoration": {
            "name": "Restoration",
            "description": "The banner regains all hit points after a Short or Long Rest."
        },
        "replacement": {
            "name": "Replacement",
            "description": "If a banner has been destroyed, any Brother can create a new one. Creating a banner requires one day of work and costs 50gp in materials per banner level."
        },
        "advancing": {
            "name": "Advancing in Level",
            "description": "The banner levels with the party. At 2nd level, three aura effects first become available. At 5th level and again at 8th level an additional aura effect becomes available."
        }
    },
    "auras": {
        "Aura of Discipline": {
            "name": "Aura of Discipline",
            "level": "2",
            "description": "Brothers gain +1 bonus to saving throws and ability checks, and have advantage on saving throws against being frightened. At 9th level, this bonus increases to +2 and Brothers are immune to being frightened."
        },
        "Aura of Valor": {
            "name": "Aura of Valor",
            "level": "2",
            "description": "Brothers within the aura gain +1 bonus to attack rolls if they are below half their normal hit point maximum. At 9th level, this bonus increases to +2."
        },
        "Aura of Resolve": {
            "name": "Aura of Resolve",
            "level": "2",
            "description": "If a Brother starts or ends his turn within the aura, that Brother gains temporary hit points equal to his proficiency bonus if they are below half their hit point maximum. At 9th level, this bonus increases to twice a Brother's proficiency bonus."
        },
        "Aura of Defiance": {
            "name": "Aura of Defiance",
            "level": "5",
            "description": "Once per round, whenever a Brother within the aura scores a critical hit, he may choose a different Brother within the aura. The chosen Brother may immediately take a Reaction to make a weapon attack with advantage."
        },
        "Aura of Brotherhood": {
            "name": "Aura of Brotherhood",
            "level": "8",
            "description": "When a Brother within the aura would be reduced to 0 hit points but not killed outright, another conscious Brother within the aura can use their reaction to move up to half their speed toward that ally, ending adjacent to them. The fallen Brother instead remains at 1 hit point."
			}
        }
    },
	"subclasses": {
		"Sawbones": {
			"description": "Physician, barber, and torturer.",
			"features": {
				"1": {
					"name": "What Comes After",
					"description": "Once per encounter, you may remind enemy combatants that what happens after the fight may be worse than anything that could happen during it. As a Bonus Action, you brandish your weapon (or torture implements) and shout out a few threats. Each enemy within 30 feet of you who can see you must make a Wisdom saving throw. On a failure, that enemy suffers disadvantage on its Morale Check if triggered during the encounter. Non-intelligent enemies (such as beasts) are immune to this ability, as are unbreakable enemies."
				},
				"3": {
					"name": "Snip & Stitch",
					"description": "Once per turn when you make an attack roll with a weapon against an enemy combatant, you may grant hit points equal to your proficiency bonus to an ally within 10 ft. You may use this ability a number of times equal to your proficiency bonus and regain all uses when you finish a Long Rest."
				},
				"7": {
					"name": "Red Pool",
					"description": "You have a pool of healing power that replenishes when you finish a Long Rest. With that pool, you can restore a total number of hit points equal to five times your level. As a Bonus Action, you can touch a creature (which could be yourself) and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in the pool."
				},
				"10": {
					"name": "Drip",
					"description": "Once on your turn when you deal damage with a weapon attack, you may assign additional damage to the target equal to twice your proficiency bonus."
				}
			}
		},
		"Bump": {
			"description": "Defensive anchor and formation fighter.",
			"features": {
				"1": {
					"name": "Iron Cocoon",
					"description": "You gain Heavy Armor proficiency. Additionally, whenever you are wearing Heavy armor, you gain damage reduction equal to your proficiency bonus against piercing, slashing, and bludgeoning attacks."
				},
				"3": {
					"name": "Linebreaker",
					"description": "Once per turn if you attack a creature within 5 feet of you as part of the Attack Action and hit with a melee weapon, you can immediately bash the target with your Shield if it is equipped, forcing the target to make a Strength saving throw. On a failed save, you either push the target 5 feet from you in any direction or cause it to have the Prone condition, your choice."
				},
				"7": {
					"name": "Shieldwall",
					"description": "While you are wielding a shield, you and any allies adjacent to you gain a +1 bonus to AC. A creature can benefit from only one Shieldwall bonus at a time. In addition, if you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can take a Reaction to take no damage if you succeed on the saving throw and are holding a Shield."
				},
				"10": {
					"name": "The Anchor",
					"description": "Once per encounter on your turn, you may enter a defensive stance with no action required. While in this stance, your speed is halved, attack rolls against you have Disadvantage, and you have advantage on Strength, Dexterity, and Constitution saving throws. This stance ends if you become incapacitated."
				}
			}
		},
		"Deacon": {
			"description": "Morale officer and chief inspirer.",
			"features": {
				"1": {
					"name": "Deacon's Inspiration",
					"description": "During an encounter you can use a Bonus Action to choose one creature other than yourself within 60 feet of you who can hear or see you. That creature gains one Inspiration die, a d6. Before the end of the encounter, the creature can roll the die and add the number rolled to one D20 Test. The creature can wait until after it rolls the d20 before deciding to use the Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Inspiration die is rolled it is lost. A creature can have only one Deacon's Inspiration die at a time. You can use this feature a number of times equal to your proficiency bonus and regain all expended uses when you finish a Long Rest. At level 7 your Deacon's Inspiration die becomes a d8. At level 10 it becomes a d10."
				},
				"3": {
					"name": "Cutting Words",
					"description": "When a creature that you can see within 60 feet of you makes a damage roll or succeeds on an ability check or attack roll, you can use a Reaction to expend one use of your Deacon's Inspiration, roll your Deacon's Inspiration die, and subtract the number rolled from the creature's roll, reducing the damage or potentially turning the success into a failure. Non-intelligent enemies such as beasts are immune to this feature."
				},
				"7": {
					"name": "Rally",
					"description": "Whenever you or an ally you can see uses the Second Wind feature, choose a different ally you can see. That ally may expend a Reaction to also use the Second Wind feature, provided they have one available."
				},
				"10": {
					"name": "Bark Orders",
					"description": "When an ally you can see is about to make a D20 Test, you can grant the roll advantage. You must declare this use before your ally makes the roll. You can use this feature a number of times equal to your proficiency bonus, regaining all uses when you finish a Long Rest."
				}
			}
		},
		"Payday": {
			"description": "Frontline damage dealer and shock trooper.",
			"features": {
				"1": {
					"name": "Fury",
					"description": "As long as you are not wearing Heavy Armor, as a Bonus Action you may enter a Fury which lasts until the end of the encounter or until you are incapacitated. You may enter a Fury a number of times equal to your proficiency bonus and regain all uses with a Long Rest. While Fury is active, you have resistance to bludgeoning, piercing, and slashing damage. When you make a weapon attack using Strength and deal damage to the target, you gain a bonus to damage equal to your proficiency bonus."
				},
				"3": {
					"name": "Reckless Attacker",
					"description": "When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time as well."
				},
				"7": {
					"name": "Bloodsport",
					"description": "Whenever an enemy suffers a critical hit made by you, you can immediately make a single melee attack against that enemy using a Bonus Action. In addition, whenever an enemy suffers a critical hit made by your ally, you can take a Reaction to immediately make a single melee attack against that enemy."
				},
				"10": {
					"name": "Kingpin",
					"description": "When you take the Attack action with a melee weapon with the Heavy or Versatile property, you may activate the Push or Topple mastery property in addition to a different mastery property you are already using with that weapon."
				}
			}
		},
		"Salt": {
			"description": "Veteran and ultimate survivor.",
			"features": {
				"1": {
					"name": "Been Here, Done This",
					"description": "At the start of an encounter, roll two d20s and record the numbers rolled. During the encounter, you can replace any D20 Test made by you or a creature that you can see with one of these rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn."
				},
				"3": {
					"name": "Survivor",
					"description": "You add your proficiency bonus to death checks. In addition, at the start of an encounter, you gain a pool of hit points equal to twice your proficiency bonus. You may assign damage you take to this pool. Whenever you land a critical hit with a weapon, or after you take damage from a critical hit, you refresh your pool."
				},
				"7": {
					"name": "Hard Road",
					"description": "Your Luck score for a session may never be less than 14, regardless of what you roll. In addition, you gain a pool of Hard Road points equal to your Luck score for the session. You may use these points as chips (+1 bonus to d20 Tests) and to adjust Luck checks for yourself or your fellow PCs. You do not lose these points when you roll a natural 1."
				},
				"10": {
					"name": "Last Brother Standing",
					"description": "You do not fall unconscious when dying, and may act normally when at 0 hp, until you fail your first death check. This ability resets with a Long Rest."
				}
			}
		},
		"Scrapper": {
			"description": "Brawler and grappler.",
			"features": {
				"1": {
					"name": "Jab",
					"description": "You can make an Unarmed Strike as a Bonus Action. Your Unarmed Strikes deal 1d6 points plus your Strength modifier bludgeoning damage. This damage increases at 5th level to d8 and again at 11th level to d10. You may choose to treat your Unarmed Strike as a finesse weapon, using your Dexterity instead of your Strength for attack and damage rolls."
				},
				"3": {
					"name": "Jab and Grab",
					"description": "When you hit a Large or smaller creature with two or more Unarmed Strikes during your turn, you may knock that creature Prone and Grapple it."
				},
				"7": {
					"name": "Hugs",
					"description": "If you start your turn in a grapple, all enemies in the grapple take your Unarmed Strike damage."
				},
				"10": {
					"name": "Human Shield",
					"description": "Once per round, when an enemy targets you with a melee or ranged attack, you may position a creature you are grappling into the line of fire. Your attacker rolls with disadvantage and on a miss, the attack hits one of your grappled foes, your choice."
				}
			}
		},
		"Slenderman": {
			"description": "Precision killer and opportunist.",
			"features": {
				"1": {
					"name": "Stabber",
					"description": "Once per turn, you can deal extra damage equal to twice your proficiency bonus if you are using a finesse weapon. At 7th level, you may do this up to twice per turn."
				},
				"3": {
					"name": "Slippery Little Bitch",
					"description": "On your turn, you can take a Bonus Action to use both Dash and Disengage."
				},
				"7": {
					"name": "Uncanny Dodge",
					"description": "When an attacker that you can see hits you with a weapon attack, you can take a Reaction to halve the attack's damage against you, rounding down."
				},
				"10": {
					"name": "Evasion",
					"description": "When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
				}
			}
		},
		"Snake": {
			"description": "Scout, tracker, and ambusher.",
			"features": {
				"1": {
					"name": "Ambusher",
					"description": "You roll initiative with advantage and add your proficiency bonus to initiative rolls. Additionally, during the first round of combat, your attack rolls against creatures that have not yet acted have Advantage, your speed is increased by 20 ft., all weapon damage you deal is maximized, and your critical hit range is increased by +1."
				},
				"3": {
					"name": "Slayer",
					"description": "When you hit a creature with a weapon, the weapon deals an extra 1d8 damage to the target if it is missing any of its hit points. You can deal this extra damage only once per turn."
				},
				"7": {
					"name": "Prey",
					"description": "When you hit a creature with an attack, you may mark it as your prey. Thereafter, your prey takes 1d4 damage each time you hit it with a weapon attack. You cannot mark new prey until your current prey is dead or the encounter is over, whichever occurs first."
				},
				"10": {
					"name": "Low Profile",
					"description": "You have learned to move with the terrain, staying beneath lines of sight. Ranged and thrown weapon attacks against you are made with disadvantage."
				}
			}
		},
		"Thunk": {
			"description": "Marksman and sniper.",
			"features": {
				"1": {
					"name": "Aim Small, Miss Small",
					"description": "Ranged and thrown weapons gain the Graze weapon mastery property when wielded by you, in addition to whatever weapon mastery property the weapon normally has."
				},
				"3": {
					"name": "Steady Aim",
					"description": "Being within 5 feet of an enemy does not impose Disadvantage on your attack rolls with ranged weapons."
				},
				"7": {
					"name": "Drawing a Bead",
					"description": "Whenever you miss a target with a ranged attack, you have Advantage on the next attack you make against that target, provided you make that attack before the end of your next turn."
				},
				"10": {
					"name": "Killing Calm",
					"description": "Once per encounter on your turn, you may enter a marksman's stance with no action required. While in this stance, your speed is halved and you have Advantage on ranged attack rolls. If you take damage, make a DC 10 Constitution saving throw and on a failure the stance ends. This stance also ends if you become incapacitated."
				}
			}
		}
	}
}